implement workspace panel, fix burg of leoarding hisotory, fixe loarding burg, implement credential module
